function lengthOfRailway(sounds) {
  //Happy Coding ^_^
  const iterations = sounds.split("呜呜呜").filter((el) => el != "");
  let sum = 0;
  for (let i = 0; i < iterations.length; i++) {
    const regexp = RegExp("哐当*", "g");
    let matches = iterations[i].matchAll(regexp);
    const res = Array.from(matches, (m) => m[0]);
    if ((i + 1) % 2 == 0) {
      sum = sum + res.length * 10;
    } else {
      sum = sum + res.length * 20;
    }
  }

  return sum;
}

console.log(
  lengthOfRailway(
    "呜呜呜哐当哐当哐当D、IQ卡，统统告哐当哐当哐当哐当呜呜呜哐当乘务员真漂亮，左手方便面，右手火腿肠。请各位旅客哐当哐当哐当哐当哐当哐当哐当又长，乘务员真漂亮，左手方便面，右手火腿肠。请各位旅客遵守哐当哐当哐当哐当呜呜呜哐当哐当报，重大事件早知道。看报了啊，中国足球，何日出头哐当有没有大夫？我老婆要生孩子啦哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当呜呜呜哐当哐当哐当哐当哐当呜呜呜哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当呜呜呜哐当哐当哐当哐当哐当哐当哐当呜呜呜哐当哐当长又长，乘务员真漂亮，左手方便面，右手火腿肠。请各位旅客遵哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当，队伍不好带啊。此刻我的内心是崩溃的。哐当哐当哐当哐当呜呜呜哐当哐当哐当哐当里有座！！！其实，我是一个演员。myji哐当面香肠茶叶蛋了啊，请出示你的车票！抓小哐当想，这人挤人的怎么开展业务啊？先生你好哐当哐当炸！胡了，清一色一条龙，每哐当哐当哐当哐当哟，我们可以下哐当哐当哐当哐当哐当哐当哐当呜呜呜哐当哐当，需要特殊服务么？我倒是想，这人挤哐当哐当国足球，何日出头？看报了啊，克哐当哐当料矿泉水了啊，泡面香肠哐当我要给他生猴子！你看看人家哐当哐当们可以下车跟踪服务的。狗哐当哐当哐当哐当，我们可以下车跟踪服务的。狗哐当哐当哐当哐当哐当~~我在这~~快来~~这里有座！！！其实，我是一个演员。哐当哐当哐当呜呜呜哐当肠。请各位旅客遵哐当哐当哐当出示你的车票！抓小偷！麻哐当诗一首：啊！火车长又长，乘务员真哐当走？闻着味就找到啦。看报了啊，早报晚报法治报，重大哐当哐当哐当哐当呜呜呜哐当生你好坏坏哟，我们可以下车哐当哐当车咱俩就离婚！请问，卫生间怎么走？闻着味就找到啦。看报了啊，哐当哐当哐当哐当哐当哐当火腿肠。请各位旅客遵守秩序，请不要在车厢哐当哐当哐当哐当哐当我想要赋诗一首：哐当哐当哐当哐当0，谢谢！这哐当哐当呜呜呜哐当哐当，左手方便面哐当哐当每位100，谢谢！这位先生，需哐当谢！这位先生，需要特殊服务么？我倒是想，这人挤人的怎么哐当哐当哐当哐当哐当哐当哐当出示你的车票！抓小偷！麻烦让一让，我要上厕所。师傅，受累挪哐当myjinxin2015太帅了，我要给哐当哐当呜呜呜哐当孩子啦！此情此景，我想要赋诗一哐当哐当，我要上厕所。师傅，受累挪一下你的行李。喂喂喂，你说什么，哐当哐当哐当哐当哐当哐当哐当面香肠茶叶蛋了啊，请出示你的车票！抓小偷！麻烦让一哐当哐当面香肠茶叶蛋了啊，请出示你的车票！抓小偷！哐当哐当哐当jinxin2015太帅了，我要给他生哐当厢内乱丢垃圾。下车的旅哐当哐当呜呜呜哐当？56789哐当哐当哐当哐当哐当。下车的旅客请注意，请携带好您的随身物品，准备哐当哐当喂喂喂，你说什么，哐当哐当饮料矿泉水了啊，泡面香肠茶叶哐当怎么开展业务啊？先生你好坏坏哟，我们哐当。师傅，受累挪一下你的行李。喂喂喂，哐当哐当哐当麻烦让一让，我要上厕所。哐当哐当他生猴子！你看看人家m哐当哐当哐当的。。。世界辣么大，我想去哐当呜呜呜哐当哐当哐当哐当了啊，请出示你的车票！抓小偷！麻烦让一让，我要上厕哐当我倒是想，这人挤人的怎哐当哐当哐当哐当哐当喂喂，你说什么，信号不好！车上有没哐当哐当哐当哐当哐当龙，每位100，谢谢！这位先生，需哐当呜呜呜哐当面，右手火腿肠。请各位旅客遵守秩哐当哐当哐当哐当呜呜呜哐当乱丢垃圾。下车的旅客请注意，请携带好您哐当哐当。看报了啊，中国足球，何日出哐当，王炸！胡了哐当哐当哐当。。世界辣么大，我想去看看！谁个龟孙把我鞋哐当哐当哐当哐当哐当哐当呜呜呜哐当哐当哐当哐当哐当哐当678910,4个二，王炸！胡了，清一色一条龙，每哐当晚报法治报，重大事件早知道。看报了啊，中国足球，何日出头？哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当哐当5，再看看你，下车咱俩就离哐当"
  ),
  4090
);
